{"loss": "binary_crossentropy", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16384}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Reshape", "config": {"target_shape": [1, 128, 128], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "reshape_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["reshape_1", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "outmap", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 3}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "outmap"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["outmap", 0, 0]], "name": "model_1"}, "sample_weight_mode": null}