_____________________________________________________________________________________________
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
input_img (InputLayer)           (None, 1L, 128L, 128L)0
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 32, 128L, 128L)320         input_img[0][0]
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 32, 128L, 128L)9248        convolution2d_1[0][0]
____________________________________________________________________________________________________
maxout2d_1 (Maxout2D)            (None, 16, 128L, 128L)1056        convolution2d_2[0][0]
____________________________________________________________________________________________________
pool1 (MaxPooling2D)             (None, 16, 64L, 64L)  0           maxout2d_1[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 16, 64L, 64L)  0           pool1[0][0]
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 32, 64L, 64L)  4640        dropout_2[0][0]
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 32, 64L, 64L)  9248        convolution2d_3[0][0]
____________________________________________________________________________________________________
maxout2d_2 (Maxout2D)            (None, 16, 64L, 64L)  1056        convolution2d_4[0][0]
____________________________________________________________________________________________________
pool2 (MaxPooling2D)             (None, 16, 32L, 32L)  0           maxout2d_2[0][0]
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 16, 32L, 32L)  0           pool2[0][0]
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 32, 32L, 32L)  4640        dropout_3[0][0]
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 32, 32L, 32L)  9248        convolution2d_5[0][0]
____________________________________________________________________________________________________
maxout2d_3 (Maxout2D)            (None, 16, 32L, 32L)  1056        convolution2d_6[0][0]
____________________________________________________________________________________________________
pool3 (MaxPooling2D)             (None, 16, 16L, 16L)  0           maxout2d_3[0][0]
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 16, 16L, 16L)  0           pool3[0][0]
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 32, 16L, 16L)  4640        dropout_4[0][0]
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 32, 16L, 16L)  9248        convolution2d_7[0][0]
____________________________________________________________________________________________________
maxout2d_4 (Maxout2D)            (None, 16, 16L, 16L)  1056        convolution2d_8[0][0]
____________________________________________________________________________________________________
pool4 (MaxPooling2D)             (None, 16, 8L, 8L)    0           maxout2d_4[0][0]
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 16, 8L, 8L)    0           pool4[0][0]
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 32, 8L, 8L)    4640        dropout_5[0][0]
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 32, 8L, 8L)    9248        convolution2d_9[0][0]
____________________________________________________________________________________________________
maxout2d_5 (Maxout2D)            (None, 16, 8L, 8L)    1056        convolution2d_10[0][0]
____________________________________________________________________________________________________
pool5 (MaxPooling2D)             (None, 16, 4L, 4L)    0           maxout2d_5[0][0]
____________________________________________________________________________________________________
maxout2d_6 (Maxout2D)            (None, 8, 4L, 4L)     272         pool5[0][0]
____________________________________________________________________________________________________
upsampling2d_1 (UpSampling2D)    (None, 8, 8L, 8L)     0           maxout2d_6[0][0]
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 24, 8L, 8L)    0           upsampling2d_1[0][0]
                                                                   pool4[0][0]
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, 16, 8L, 8L)    3472        merge_1[0][0]
____________________________________________________________________________________________________
maxout2d_7 (Maxout2D)            (None, 8, 8L, 8L)     272         convolution2d_11[0][0]
____________________________________________________________________________________________________
upsampling2d_2 (UpSampling2D)    (None, 8, 16L, 16L)   0           maxout2d_7[0][0]
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 24, 16L, 16L)  0           upsampling2d_2[0][0]
                                                                   pool3[0][0]
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, 16, 16L, 16L)  3472        merge_2[0][0]
____________________________________________________________________________________________________
maxout2d_8 (Maxout2D)            (None, 8, 16L, 16L)   272         convolution2d_12[0][0]
____________________________________________________________________________________________________
upsampling2d_3 (UpSampling2D)    (None, 8, 32L, 32L)   0           maxout2d_8[0][0]
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 24, 32L, 32L)  0           upsampling2d_3[0][0]
                                                                   pool2[0][0]
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D) (None, 16, 32L, 32L)  3472        merge_3[0][0]
____________________________________________________________________________________________________
maxout2d_9 (Maxout2D)            (None, 8, 32L, 32L)   272         convolution2d_13[0][0]
____________________________________________________________________________________________________
upsampling2d_4 (UpSampling2D)    (None, 8, 64L, 64L)   0           maxout2d_9[0][0]
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 24, 64L, 64L)  0           upsampling2d_4[0][0]
                                                                   pool1[0][0]
____________________________________________________________________________________________________
convolution2d_14 (Convolution2D) (None, 16, 64L, 64L)  3472        merge_4[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 256)           0           pool5[0][0]
____________________________________________________________________________________________________
maxout2d_10 (Maxout2D)           (None, 8, 64L, 64L)   272         convolution2d_14[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 32)            8224        flatten_1[0][0]
____________________________________________________________________________________________________
upsampling2d_5 (UpSampling2D)    (None, 8, 128L, 128L) 0           maxout2d_10[0][0]
____________________________________________________________________________________________________
dropout_6 (Dropout)              (None, 8, 128L, 128L) 0           upsampling2d_5[0][0]
____________________________________________________________________________________________________
leakyrelu_1 (LeakyReLU)          (None, 32)            0           dense_1[0][0]
____________________________________________________________________________________________________
convolution2d_15 (Convolution2D) (None, 8, 128L, 128L) 584         dropout_6[0][0]
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 16)            528         leakyrelu_1[0][0]
____________________________________________________________________________________________________
convolution2d_16 (Convolution2D) (None, 8, 128L, 128L) 584         convolution2d_15[0][0]
____________________________________________________________________________________________________
leakyrelu_2 (LeakyReLU)          (None, 16)            0           dense_2[0][0]
____________________________________________________________________________________________________
outbin (Dense)                   (None, 1)             17          leakyrelu_2[0][0]
____________________________________________________________________________________________________
outmap (Convolution2D)           (None, 1, 128L, 128L) 73          convolution2d_16[0][0]
____________________________________________________________________________________________________
outmap4 (Convolution2D)          (None, 1, 8L, 8L)     9           maxout2d_7[0][0]
____________________________________________________________________________________________________
outmap5 (Convolution2D)          (None, 1, 4L, 4L)     9           maxout2d_6[0][0]
====================================================================================================
Total params: 95676
____________________________________________________________________________________________________